-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: adarf
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `ad_medicine`
--

LOCK TABLES `ad_medicine` WRITE;
/*!40000 ALTER TABLE `ad_medicine` DISABLE KEYS */;
INSERT INTO `ad_medicine` VALUES (1,'布洛芬缓释胶囊','恶心、胃部灼烧感，少数人起皮疹','活动性消化道溃疡患者禁用','H20183124'),(3,'头孢克肟分散片','腹泻、皮肤瘙痒，严重可诱发过敏性休克','头孢类抗生素过敏人群禁用','H20040528'),(4,'蒙脱石散','单次大量服用易引发便秘','存在肠梗阻风险人群禁用','H20003690'),(5,'复方甘草片','轻微头晕、恶心，长期服用易产生依赖','醛固酮增多症患者禁用','Z61020712'),(6,'碳酸钙D3片','嗳气、腹胀、便秘','高钙血症、肾结石患者禁用','H20030421'),(7,'对乙酰氨基酚片','过量服用损伤肝脏，偶见皮肤皮疹','严重肝功能不全人群禁用','H44023355'),(8,'盐酸西替利嗪口服溶液','短暂困倦、口腔干燥','对西替利嗪或辅料过敏者禁用','H20040317'),(9,'川贝枇杷膏','糖分较高，部分人会腹胀不适','糖尿病患者慎用','Z20083210'),(10,'奥美拉唑肠溶胶囊','轻微腹胀、偶发头痛','对质子泵抑制剂类药物过敏者禁用','H20013180'),(11,'阿司匹林肠溶片','胃部隐痛、牙龈易出血','活动性出血、胃溃疡急性期禁用','H11021293'),(12,'盐酸氨溴索口服溶液','偶发肠胃轻微不适、少量皮疹','对氨溴索成分过敏人群禁用','H20031317'),(13,'阿莫西林胶囊','皮疹、腹泻，严重可过敏性休克','青霉素类药物过敏者禁用','H13024128'),(14,'阿奇霉素干混悬剂','腹痛、恶心，短暂转氨酶升高','大环内酯类药物过敏者禁用','H10970065'),(15,'左氧氟沙星片','肌腱酸痛、失眠，存在光敏反应','18周岁以下青少年禁止使用','H20003656'),(16,'硝酸甘油片','面部潮红、低血压性头痛','严重低血压、青光眼患者禁用','H12020002'),(17,'硝苯地平缓释片','脚踝水肿、面部发红','严重低血压人群禁用','H31022750'),(18,'二甲双胍片','腹胀、腹泻，口腔金属异味','重度肾功能衰竭患者禁用','H31020044'),(19,'藿香正气水','醉酒样反应，胃肠道刺激','酒精过敏人群禁用','Z13020693'),(20,'连花清瘟胶囊','恶心、轻度腹泻、皮疹','风寒重症感冒人群慎用','Z20040063'),(21,'板蓝根颗粒','胃部寒凉不适感重','脾胃虚寒经常腹泻人群慎用','Z45020961'),(22,'蒲地蓝消炎口服液','腹胀、稀便','脾胃虚寒者慎用','Z20030095'),(23,'西瓜霜润喉片','短暂咽喉轻微刺激','虚寒型咽痛人群慎用','Z10980143'),(24,'金嗓子喉片','胃部寒凉不适','脾虚容易腹泻人群慎用','Z45020994'),(25,'牛黄解毒片','腹痛腹泻，长期服用砷蓄积风险','孕妇、脾胃虚弱人群禁用','Z12020402'),(26,'六味地黄丸','腹胀、食欲减退','痰湿严重体质人群慎用','Z41021968'),(27,'金匮肾气丸','燥热上火、口干舌燥','阴虚火旺人群禁用','Z13020711'),(28,'益母草颗粒','腹痛加剧、月经量增多','妊娠期女性禁用','Z33020417'),(29,'云南白药胶囊','轻微胃部不适，偶发皮疹','过敏体质慎用，孕妇禁用','Z53020799'),(30,'碘伏消毒液','皮肤短暂轻微刺激','碘元素过敏人群禁用','H31021243'),(31,'红霉素软膏','局部皮肤瘙痒、红疹','红霉素过敏者禁用','H31022234'),(32,'莫匹罗星软膏','涂抹处灼热刺痛感','莫匹罗星成分过敏者禁用','H10930065'),(33,'炉甘石洗剂','皮肤干燥紧绷感','大面积皮肤渗出破损时慎用','H31021988'),(34,'阿昔洛韦乳膏','患处短暂轻微刺痛','阿昔洛韦药物过敏者禁用','H10900033'),(35,'布地奈德鼻喷雾剂','鼻腔干燥、少量鼻出血，咽喉刺激','严重鼻腔真菌感染患者禁用','H20010589'),(36,'生理性海水鼻腔喷雾','短暂鼻腔刺痛','存在鼻腔穿孔风险人群慎用','H20163130'),(37,'玻璃酸钠滴眼液','眼部短暂异物感','眼部急性重度感染慎用','H20054047'),(38,'左氧氟沙星滴眼液','眼干、眼球刺痛','喹诺酮类药物过敏者禁用','H20040230'),(39,'布洛芬混悬液(儿童)','恶心、轻度嗜睡','活动性肠胃出血患儿禁用','H19983136'),(40,'对乙酰氨基酚混悬滴剂','偶见皮疹，过量造成肝损伤','严重肝病婴幼儿禁用','H31022344'),(41,'小儿氨酚黄那敏颗粒','嗜睡、口干、食欲变差','严重肝肾功能不全儿童禁用','H36020486'),(42,'口服补液盐散','恶心腹胀、呕吐','肠梗阻、重度频繁呕吐患儿禁用','H20093757'),(43,'阿苯达唑片','恶心腹胀、轻微头痛','孕妇、2周岁以下幼儿禁用','H32020477'),(44,'孟鲁司特钠咀嚼片(儿童)','头痛、烦躁多梦','孟鲁司特钠过敏者禁用','H20020372'),(45,'沙丁胺醇气雾剂','手抖、心慌、心跳加快','严重心律失常患者禁用','H31020614'),(46,'聚乙二醇4000散','腹胀、水样腹泻','消化道穿孔、肠梗阻患者禁用','H20083405'),(47,'地衣芽孢杆菌活菌胶囊','轻度腹胀、排气增多','重度免疫缺陷人群慎用','S20080031'),(48,'双歧杆菌三联活菌胶囊','短暂腹部隐痛、排气增多','免疫功能重度受损人群慎用','S10950032'),(49,'马来酸氯苯那敏片','强烈嗜睡、口干、排尿不畅','重度前列腺肥大患者慎用','H31022304'),(50,'右美沙芬愈创甘油醚糖浆','嗜睡、头晕、恶心痰多','痰液黏稠堵塞气道人群慎用','H20057937'),(51,'复方氨酚烷胺胶囊','嗜睡、头晕、上腹不适','严重肝肾损伤患者禁用','H22025445'),(52,'酚麻美敏片','困倦、口干、心率加快','重度高血压患者慎用','H20013948'),(53,'碳酸钙D3咀嚼片','嗳气、便秘腹胀','高钙血症、甲状旁腺亢进患者禁用','H20030421'),(54,'硫酸氨基葡萄糖胶囊','胃部隐痛腹胀，轻微皮疹','甲壳海鲜过敏人群禁用','H20041305'),(55,'塞来昔布胶囊','下肢水肿、胃痛，心血管潜在风险','活动性消化道溃疡、重度心衰禁用','H20044331'),(56,'维生素C片','过量易腹泻，增加肾结石风险','草酸钙结石患者慎用','H31021124'),(57,'维生素D软胶囊','高钙血症、恶心多尿','高钙血症、重度肾衰患者禁用','H20113033'),(58,'甲钴胺片','皮疹、轻微腹泻、头痛','甲钴胺成分过敏者禁用','H20043026'),(59,'谷维素片','胃部不适、嗜睡、体重波动','胃十二指肠溃疡人群慎用','H33020813'),(60,'安神补脑液','燥热口干上火','阴虚火旺重症人群慎用','Z22022453'),(61,'创可贴苯扎氯铵贴','贴敷处皮肤瘙痒红肿','苯扎氯铵过敏人群禁用','H31021891'),(62,'风油精','皮肤灼热刺激感，黏膜刺痛','皮肤破溃、过敏体质慎用','Z32020917'),(63,'清凉油','局部皮肤刺激，入眼剧痛','眼周、破损皮肤禁止使用','Z32020918'),(64,'开塞露(含甘油)','肛周轻微刺激、短暂腹痛','存在肠道穿孔风险人群禁用','H32020328'),(65,'乳果糖口服溶液','初期腹胀、过量腹泻','肠梗阻患者禁用','H20093543'),(66,'多潘立酮片','泌乳、心悸头晕','催乳素瘤患者禁用','H10910003'),(67,'铝碳酸镁咀嚼片','轻微便秘、口干','重度肾损伤人群慎用','H20013410'),(68,'格列美脲片','低血糖、头晕乏力','1型糖尿病患者禁用','H20010566'),(69,'阿卡波糖片','排气增多、腹胀难忍','重度肠道疾病患者禁用','H19990205'),(70,'胰岛素注射液','低血糖、皮下注射处红肿','低血糖发作期间禁用','S20030055'),(71,'氢氯噻嗪片','低钾乏力、尿酸升高诱发痛风','痛风急性期患者禁用','H31021278'),(72,'螺内酯片','高钾血症、男性乳房胀痛','高钾血症患者禁用','H32020077'),(73,'氯沙坦钾片','头晕乏力、血钾升高','妊娠中晚期妇女禁用','H20000264'),(74,'美托洛尔片','心动过缓、四肢发冷乏力','二度以上房室传导阻滞禁用','H32025171'),(75,'辛伐他汀片','肌肉酸痛、转氨酶升高','活动性肝病患者禁用','H20003199'),(76,'秋水仙碱片','严重恶心腹泻、肌肉损伤','重度肾功能不全患者禁用','H53020168'),(77,'别嘌醇片','重症皮疹、肝功能损伤','HLA-B*5801基因高风险人群慎用','H31021689'),(78,'非布司他片','肝功能异常、痛风关节痛加重','痛风急性发作初期不推荐使用','H20130009'),(79,'骨化三醇软胶囊','高钙血症、恶心多尿','高钙血症、重度肾衰患者禁用','H20030422'),(80,'特比萘芬乳膏','涂抹处发红瘙痒加重','抗真菌药物过敏者禁用','H20003286'),(81,'复方氯己定含漱液','短暂味觉改变、牙齿染色','氯己定成分过敏者禁用','H31022689'),(82,'匹多莫德口服溶液','皮疹、轻微腹泻','3周岁以下儿童不推荐使用','H20030387'),(83,'布地奈德福莫特罗粉吸入剂','口腔念珠菌感染、心悸','哮喘急性重度发作初期慎用','H20140474'),(84,'色甘酸钠气雾剂','咽喉轻微刺激、短暂咳嗽','严重气道痉挛人群慎用','H31022601'),(85,'乳酶生片','极少皮疹，无显著不良反应','活菌制剂过敏人群禁用','H31020882'),(86,'赛庚啶片','嗜睡头晕、食欲亢进','青光眼、尿潴留患者禁用','H32023053'),(87,'异丙嗪片','重度嗜睡，幼儿呼吸抑制风险','2周岁以下婴幼儿禁用','H32024437'),(88,'愈美片','乏力口干、轻度便秘','重度慢阻肺患者慎用','H20013193'),(89,'美敏伪麻溶液','心慌嗜睡、排尿不畅','前列腺增生男性慎用','H20023976'),(90,'美沙拉嗪肠溶片','头痛恶心皮疹，影响肾功能','重度肝肾功能衰竭禁用','H20013591'),(91,'柳氮磺吡啶肠溶片','皮疹、白细胞减少、肾损伤','磺胺类药物过敏者禁用','H31020431'),(92,'孟婆汤','飞起来','忘了','123561554');
/*!40000 ALTER TABLE `ad_medicine` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `ad_record`
--

LOCK TABLES `ad_record` WRITE;
/*!40000 ALTER TABLE `ad_record` DISABLE KEYS */;
INSERT INTO `ad_record` VALUES (1,'小明gang','老李','布洛芬缓释胶囊','测试样例001','7','2026-06-12 15:13:47','已通过','测试建议001'),(2,'小明gang','小红','双歧杆菌三联活菌胶囊','测试样例002','1','2026-06-12 15:14:04','已驳回','测试建议002'),(3,'老张',NULL,'牛黄解毒片','测试样例003','3','2026-06-12 15:14:56','待审核',NULL);
/*!40000 ALTER TABLE `ad_record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `ad_user`
--

LOCK TABLES `ad_user` WRITE;
/*!40000 ALTER TABLE `ad_user` DISABLE KEYS */;
INSERT INTO `ad_user` VALUES (1,'小明gang','123456',1,NULL,'启用'),(2,'小红','123',2,'青霉素过敏','启用'),(3,'阿伟','654321',1,'芒果、海鲜过敏','启用'),(4,'阿芳','123000',3,NULL,'禁用'),(5,'老张','000123',1,'头孢类药物过敏','启用'),(6,'小百','123789',2,'花生过敏','禁用'),(8,'老李','123666',2,'阿司匹林过敏','启用'),(9,'测试','123999',3,NULL,'禁用'),(10,'总管','123111',4,'虾蟹过敏','启用'),(11,'nskdf','123',1,'','启用'),(12,'N_K','123',3,NULL,'启用'),(13,'老汉','852',2,NULL,'启用');
/*!40000 ALTER TABLE `ad_user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-12 15:34:19
